Repository: alexup71rus/MyWallet
Catalog: lib/l10n/app_*.arb
Languages: ja, ru

# appTitle
source: My Wallet
ja: マイウォレット
ru: Мой кошелек

# homeWalletEmptyTitle
source: Your wallet is empty
ja: ウォレットは空です
ru: Ваш кошелек пуст

# homeWalletEmptySubtitle
source: Add your first loyalty card
ja: 最初のポイントカードを追加しましょう
ru: Добавьте свою первую карту лояльности

# homeAddCard
source: Add Card
ja: カードを追加
ru: Добавить карту

# homeFailedImport
source: Failed to import card: {error}
ja: カードのインポートに失敗しました: {error}
ru: Не удалось импортировать карту: {error}

# settingsTitle
source: Settings
ja: 設定
ru: Настройки

# settingsGoogleDriveSection
source: Google Drive Backup
ja: Google Drive バックアップ
ru: Резервная копия Google Drive

# settingsLocalBackupSection
source: Local Backup
ja: ローカルバックアップ
ru: Локальная резервная копия

# settingsAboutSection
source: About
ja: 情報
ru: О приложении

# settingsNotSignedIn
source: Not Signed In
ja: 未ログイン
ru: Не выполнен вход

# settingsSignIn
source: Sign In
ja: ログイン
ru: Войти

# settingsBackupToDrive
source: Backup to Drive
ja: Drive にバックアップ
ru: Сохранить в Drive

# settingsRestoreFromDrive
source: Restore from Drive
ja: Drive から復元
ru: Восстановить из Drive

# settingsExportToFile
source: Export to File
ja: ファイルにエクスポート
ru: Экспорт в файл

# settingsImportFromFile
source: Import from File
ja: ファイルからインポート
ru: Импорт из файла

# settingsImportPkpass
source: Import .pkpass Card
ja: .pkpass カードをインポート
ru: Импорт карты .pkpass

# settingsMaxBrightnessTitle
source: Max Brightness on Card
ja: カード表示時の最大輝度
ru: Максимальная яркость на карте

# settingsMaxBrightnessSubtitle
source: Increase screen brightness when viewing QR codes
ja: QRコード表示時に画面の明るさを上げます
ru: Увеличивать яркость при просмотре QR-кодов

# settingsNearbySortingTitle
source: Nearby Pass Sorting
ja: 近くのパスの並び替え
ru: Сортировка по близости

# settingsNearbySortingSubtitle
source: Sort passes by distance using your location
ja: 位置情報で距離順に並べ替えます
ru: Сортировать карты по расстоянию с помощью геолокации

# settingsVersion
source: Version
ja: バージョン
ru: Версия

# settingsLanguageSection
source: Language
ja: 言語
ru: Язык

# settingsLanguageTitle
source: App Language
ja: アプリの言語
ru: Язык приложения

# settingsLanguageChoose
source: Choose Language
ja: 言語を選択
ru: Выберите язык

# settingsLanguageSave
source: Continue
ja: 続行
ru: Продолжить

# settingsLanguageCancel
source: Cancel
ja: キャンセル
ru: Отмена

# snackbarEnableLocationServices
source: Enable location services to use nearby sorting.
ja: 近くの並び替えを使うには位置情報サービスを有効にしてください。
ru: Включите службы геолокации для сортировки по близости.

# snackbarLocationDenied
source: Location permission denied.
ja: 位置情報の権限が拒否されました。
ru: Доступ к геолокации запрещен.

# snackbarLocationBlocked
source: Location permission blocked. Enable it in Settings.
ja: 位置情報の権限がブロックされています。設定で有効にしてください。
ru: Доступ к геолокации заблокирован. Разрешите в настройках.

# snackbarSignInFailed
source: Sign in failed: {error}
ja: ログインに失敗しました: {error}
ru: Вход не выполнен: {error}

# snackbarBackupUploaded
source: Backup uploaded successfully!
ja: バックアップをアップロードしました！
ru: Резервная копия загружена!

# snackbarBackupFailed
source: Backup failed: {error}
ja: バックアップに失敗しました: {error}
ru: Не удалось создать резервную копию: {error}

# snackbarNoBackupFound
source: No backup found.
ja: バックアップが見つかりません。
ru: Резервная копия не найдена.

# snackbarRestoreSuccessful
source: Restore successful!
ja: 復元しました！
ru: Восстановление выполнено!

# snackbarInvalidBackupFormat
source: Invalid backup format.
ja: バックアップ形式が無効です。
ru: Неверный формат резервной копии.

# snackbarRestoreFailed
source: Restore failed: {error}
ja: 復元に失敗しました: {error}
ru: Не удалось восстановить: {error}

# snackbarExportFailed
source: Export failed: {error}
ja: エクスポートに失敗しました: {error}
ru: Экспорт не удался: {error}

# snackbarImportSuccessful
source: Import successful!
ja: インポートしました！
ru: Импорт выполнен!

# snackbarInvalidFileFormat
source: Invalid file format.
ja: ファイル形式が無効です。
ru: Неверный формат файла.

# snackbarDecodeFailed
source: Failed to decode JSON: {message}
ja: JSONの解析に失敗しました: {message}
ru: Не удалось декодировать JSON: {message}

# snackbarImportFailed
source: Import failed: {error}
ja: インポートに失敗しました: {error}
ru: Импорт не удался: {error}

# snackbarPkpassParseFailed
source: Failed to parse .pkpass file.
ja: .pkpass ファイルの解析に失敗しました。
ru: Не удалось разобрать файл .pkpass.

# snackbarPkpassImported
source: Card imported from .pkpass
ja: .pkpass からカードをインポートしました
ru: Карта импортирована из .pkpass

# snackbarPkpassImportFailed
source: PKPASS import failed: {error}
ja: PKPASS のインポートに失敗しました: {error}
ru: Импорт PKPASS не удался: {error}

# backupShareText
source: MyWallet Backup
ja: MyWallet バックアップ
ru: Резервная копия MyWallet

# addCardTitle
source: Add New Card
ja: 新しいカードを追加
ru: Добавить карту

# addCardStorePlaceholder
source: Store Name
ja: 店舗名
ru: Название магазина

# addCardServiceNameLabel
source: Service Name
ja: サービス名
ru: Название сервиса

# addCardServiceNameHint
source: e.g. Starbucks, Tesco
ja: 例：スターバックス、Tesco
ru: например Starbucks, Tesco

# addCardNameValidation
source: Please enter a name
ja: 名前を入力してください
ru: Введите название

# addCardTypeLabel
source: Card Type
ja: カードタイプ
ru: Тип карты

# cardTypeLoyalty
source: Loyalty Card
ja: ポイントカード
ru: Карта лояльности

# cardTypeGift
source: Gift Card
ja: ギフトカード
ru: Подарочная карта

# cardTypeMembership
source: Membership Card
ja: 会員カード
ru: Членская карта

# cardTypeDiscount
source: Discount Card
ja: 割引カード
ru: Дисконтная карта

# cardTypeClub
source: Club Card
ja: クラブカード
ru: Клубная карта

# addCardCodeLabel
source: Card Code
ja: カード番号
ru: Код карты

# addCardCodeHint
source: Scan or enter code
ja: スキャンまたは入力
ru: Сканируйте или введите код

# addCardCodeValidation
source: Please enter a code
ja: コードを入力してください
ru: Введите код

# addCardIconLabel
source: Card Icon
ja: カードアイコン
ru: Иконка карты

# addCardColorLabel
source: Card Color
ja: カードカラー
ru: Цвет карты

# addCardSave
source: Save Card
ja: カードを保存
ru: Сохранить карту

# addCardLinkNotPass
source: Link did not return a valid pass file. Using as code.
ja: リンクから有効なパスファイルが取得できませんでした。コードとして使用します。
ru: Ссылка не вернула файл пропуска. Используем как код.

# addCardFailedFetch
source: Failed to fetch link: {status}
ja: リンクの取得に失敗しました: {status}
ru: Не удалось загрузить ссылку: {status}

# addCardDownloadError
source: Error downloading: {error}
ja: ダウンロードエラー: {error}
ru: Ошибка загрузки: {error}

# scannerTitle
source: Scan QR Code
ja: QRコードをスキャン
ru: Сканировать QR-код

# cardUpdated
source: Card updated successfully
ja: カードを更新しました
ru: Карта обновлена

# cardUpdateFailed
source: No updates available or update failed
ja: 更新がありません、または更新に失敗しました
ru: Обновления недоступны или не удалось обновить

# cardDeleteTitle
source: Delete Card
ja: カードを削除
ru: Удалить карту

# cardDeleteConfirm
source: Are you sure you want to remove this card?
ja: このカードを削除してもよろしいですか？
ru: Вы уверены, что хотите удалить эту карту?

# cardDeleteCancel
source: Cancel
ja: キャンセル
ru: Отмена

# cardDeleteAction
source: Delete
ja: 削除
ru: Удалить

# cardShowCodeHint
source: Show this code at checkout Pull down to refresh balance
ja: レジでこのコードを提示してください 下に引いて残高を更新
ru: Покажите этот код на кассе Потяните вниз для обновления баланса

# barcodeError
source: Error generating barcode: {error}
ja: バーコードの生成エラー: {error}
ru: Ошибка генерации штрихкода: {error}

# qrCodeLabel
source: QR code
ja: QRコード
ru: QR-код

# pointsLabelDefault
source: Points
ja: ポイント
ru: Баллы

# languageEnglish
source: English
ja: 英語
ru: Английский

# languageChineseSimplified
source: Simplified Chinese
ja: 中国語（簡体）
ru: Китайский (упрощенный)

# languageJapanese
source: Japanese
ja: 日本語
ru: Японский

# languageRussian
source: Russian
ja: ロシア語
ru: Русский

# languageArabic
source: Arabic
ja: アラビア語
ru: Арабский
